Repository: jim-easterbrook/pywws
Catalog: translations/*/guides.po
Languages: fr

source: How to get started with pywws
fr: Comment démarrer avec pywws

source: Download and unpack the pywws software.
fr: Télécharger et décompresser le logiciel pywws.

source: Create a directory for all your weather related files and change to it. For example (on a Linux or similar operating system)::
fr: Créer un dossier pour tous vos fichiers reliés à la météo et vous positionner dans ce dossier. Par exemple (avec un système d'exploitation Linux ou similaire)::

source: Visit the pywws website https://github.com/jim-easterbrook/pywws/downloads and download one of the .tar.gz or .zip files. Put it in your weather directory, then extract all the files, for example::
fr: Visiter le site web de pywws https://github.com/jim-easterbrook/pywws/downloads et télécharger le fichier .tar.gz ou .zip. Enregistrez-le dans votre dossier "weather", puis extraire tous les fichiers de l'archive, par exemple::

source: or::
fr: ou::

source: Install dependencies.
fr: Fichiers prérequis.

source: Python 2.4+ - http://python.org/ (Note: Python 3 support is under development.)
fr: Python 2.4+ - http://python.org/ (Note: Le support de Python 3 est en développement)

source: USB library option 1 (best for small systems such as routers):
fr: Librarie USB - option 1 (préférable pour les petits systèmes, comme les routeurs)

source: USB library option 2:
fr: Librarie USB - option 2:

source: USB library option 3 (best for MacOS):
fr: Librarie USB - option 3 (préférable pour les Mac)

source: You may be able to install these using your operating system's package manager. This is a lot easier than downloading and compiling the source files from the project websites. Note that some Linux distributions may use different names for some of the packages, e.g. in Ubuntu, pyusb is python-usb.
fr: Vous serez peut-être en mesure de les installer sur votre PC via un gestionnaire de paquet. Cette solution est beaucoup plus facile que de télécharger et compiler les fichiers source à partir des sites de projet. Noter que des distributions Linux peuvent utiliser des noms différents pour certains paquets, ex. sur Ubuntu, pyusb se nomme python-usb.

source: PyUSB can also be installed from PyPI using the ``pip`` command::
fr: PyUSB peut aussi être installé à partir de PyPI en utilisant la commande ``pip``::

source: (Python 3 users only) Translate pywws to Python 3.
fr: (Utilisateur de Python 3 seulement) Convertir pywws pour Python 3.

source: Change to your pywws directory then use ``make`` to convert Python 2 code to Python 3::
fr: Positionnez vous dans le répertoire de pywws et utilisez ``make`` pour convertir le code Python 2 en code Python 3::

source: This should create a ``code3`` directory which you use instead of the ``code`` directory in the following instructions.
fr: Ceci devrait créer un répertoire ``code3`` que vous devrez utiliser au lieu du répertoire ``code`` dans les instructions qui suivent.

source: Test the weather station connection.
fr: Tester la connexion de la station météo.

source: Connect the weather station (if not already connected) then run the :py:mod:`TestWeatherStation` program. Change to the source code directory first. For example::
fr: Brancher la station météo (si ce n'est déjà fait), puis exécuter le programme :py:mod:`TestWeatherStation`. En premier lieu, changer de répertoire pour le dossier source de pywws. Par exemple::

source: If everything is working correctly, this should dump a load of numbers to the screen, for example::
fr: Si tout fonctionne correctement, vous devriez voir apparaitre un lot de chiffre ressemblant à ceci::

source: There are several reasons why this might not work. Most likely is a 'permissions' problem. This can be tested by running the command as root::
fr: Si ce test ne fonctionne pas, plusieurs facteurs peuvent être en cause, mais le plus courant est un problème de 'permissions'; ce qui peut être vérifié en exécutant la commande suivante avec les droits 'root'::

source: If this works then you may be able to allow your normal user account to access the weather station by setting up a 'udev' rule. See the compatibility wiki page http://code.google.com/p/pywws/wiki/Compatibility for more details.
fr: Si celà fonctionne, vous devriez être capable de permettre à votre compte utilisateur normal d'accéder à votre station météo en créant une règle 'udev'. Voir la page de compatibilité du wiki http://code.google.com/p/pywws/wiki/Compatibility (en anglais) pour plus de détails.

source: If you have any other problem, please ask for help on the pywws mailing list: http://groups.google.com/group/pywws
fr: Pour tout autre problème, n'hésitez pas à demander de l'aide sur la liste de publipostage de pywws: http://groups.google.com/group/pywws

source: Log your weather station data.
fr: Enregistrer les données de votre station météo.

source: First, choose a directory to store all your weather station data. This will be written to quite frequently, so a disk drive is preferable to a memory stick, as these have a limited number of writes. In most cases your home directory is suitable, for example::
fr: En premier lieu, choisissez un dossier pour entreposer toute les données de votre station météo. Ces données étant écrites très fréquemment, un disque rigide sera préférable a une mémoire Flash (USB), puisque ces dernières ont un nombre d'écriture limité. Dans la plupart des cas, le répertoire personnel est préférable, par exemple::

source: This directory is referred to elsewhere in the pywws documentation as your data directory.
fr: Ce répertoire est référé dans la documentation pywws en tant que votre répertoire de données.

source: Make sure your computer has the right date & time, and time zone, as these are used to label the weather station data. If you haven't already done so, it's worth setting up NTP to synchronise your computer to a 'time server'.
fr: Assurez-vous que votre ordinateur ait l'heure & date précis, ainsi que le fuseau horaire approprié, puisqu'ils seront utilisés pour identifier les données de votre station météo. Si vous ne l'avez pas déjà fait, il pourrait être utile d'utiliser la synchronisation horaires par réseau (NTP) pour synchroniser votre ordinateur à un 'serveur de temps'.

source: Make sure your weather station has the correct offset between 'absolute' and 'relative' atmospheric pressure. See the instruction book for details on how to set this.
fr: Assurez-vous que votre station météo a le bon décalage entre la pression atmosphérique 'absolue' et 'relative'. Voir le feuillet d'instruction de votre station pour savoir comment faire cet ajustement.

source: The first time you run :py:mod:`pywws.LogData` it will create a configuration file in your data directory called 'weather.ini' and then stop. You need to edit the configuration file and change the line ``ws type = Unknown`` to ``ws type = 1080`` or ``ws type = 3080``. (If your weather station console displays solar illuminance you have a 3080 type, all others are 1080.) Then run :py:mod:`pywws.LogData` again. This may take several minutes, as it will copy all the data stored in your station's memory. The :py:mod:`pywws.LogData` program has a 'verbose' option that increases the amount of messages it displays while running. This is useful when running it manually, for example::
fr: La première fois que vous exécutez :py:mod:`pywws.LogData` un fichier de configuration, nommé 'weather.ini', sera créé dans votre répertoire de données, puis s"arrêtera. Vous devez éditer ce fichier de configuration et y modifier la ligne ``ws type = Unknown`` à ``ws type = 1080`` ou ``ws type = 3080``. (Si la console de votre station météo affiche la luminosité solaire, vous avec une station de type 3080, sinon, vous indiquez le type 1080.) Puis exécutez :py:mod:`pywws.LogData` de nouveau. Cette fois, l'exécution peut durer quelques minutes, puisqu'il copiera l'intégralité des données météo emmagasinées dans la mémoire de votre météo. Le programme :py:mod:`pywws.LogData` possède une option de 'verbose' qui augmente le nombre de messages affichés pendant l'exécution. Cette option est utile lors d'exécution manuelle, par exemple::

source: (Replace ``~/weather/data`` with your data directory, if it's different.)
fr: (Remplacez ``~/weather/data`` par votre répertoire de données, si différent.)

source: You should now have some data files you can look at. For example::
fr: Vous devriez maintenant avoir quelques fichiers de données à regarder. Par exemple::

source: (Replace the year, month and day with ones that you have data for.)
fr: (Remplacez l'année, mois et jour par la date pour laquelle vous devriez avoir des données.)

source: Convert old EasyWeather data (optional).
fr: Convertir les anciennes données de EasyWeather (optionnel).

source: If you had been running EasyWeather before deciding to use pywws, you can convert the data EasyWeather had logged to the pywws format. Find your EasyWeather.dat file and then convert it::
fr: Si vous utilisiez EasyWeather avant de décider d'utiliser pywws, vous pouvez convertir les données que EasyWeather a enregistré au format de pywws. Localisez votre fichier EasyWeather.dat et convertissez-le ainsi::

source: Set some configuration options.
fr: Indiquer quelques options de configuration.

source: After running :py:mod:`pywws.LogData` there should be a configuration file in your data directory called 'weather.ini'. Open this with a text editor. You should find something like the following::
fr: Après avoir exécuté :py:mod:`pywws.LogData`, il devrait y avoir un fichier de configuration nommé 'weather.ini' dans votre répertoire de données. Ouvrez ce fichier avec un éditeur de texte. Vous devriez y trouver des lignes semblables à celle-ci::

source: The line ``[fixed]`` marks the start of a section (called '[fixed]'), and the following lines are entries in that section. The ``ws type`` entry can be set to ``1080`` or ``3080``. If your station's console displays illuminance and UV information, set it to ``3080``. The ``pressure offset`` entry stores the difference between absolute and relative atmospheric pressure that was read from the weather station. The ``fixed block`` entry stores a large amount of data from the station's 'fixed block' memory.
fr: La ligne ``[fixed]`` marque le début de la section (nommée '[fixed]'), et les lignes suivantes sont des entrées dans cette section. L'entrée ``ws type`` peut indiquer ``1080`` ou ``3080``. Si la console de votre station affiche les informations UV, indiquez ``3080``. L'entrée ``pressure offset`` emmagasine la différence entre la pression atmosphérique absolue et relative lue depuis la station météo. L'entrée ``fixed block`` emmagasine une importante somme de données du bloc fixe de mémoire de la station.

source: You need to add a new entry in the ``[config]`` section called ``day end hour``. This tells pywws what convention you want to use when calculating daily summary data. In the UK, the 'meteorological day' is usually from 09:00 to 09:00 GMT (10:00 to 10:00 BST during summer), so I use a day end hour value of 9. In other countries a value of 24 (or 0) might be more suitable. Note that the value is set in local winter time. You should not need to change it when daylight savings time is in effect.
fr: Vous devez ajouter une nouvelle entrée nommée ``day end hour`` dans la section ``[config]``. Ceci indique à pywws quelle convention vous souhaitez utiliser pour le calcul su commaire des données quotidiennes. En Grande-Bretagne, le 'jour météorologique' s'étale habituellement de 09:00 à 09:00 GMT (10:00 à 10:00 BST durant l'été), j'utilise donc 9 pour l'heure de fin du jour. Dans d'autres pays une caleur de 24 (ou 0) peut être souhaitable. Noter que cette valeur est définie à l'heure hivernale locale. Vous ne devriez pas avoir besoin de changer cette valeur pendant la saison chaude.

source: After editing, your weather.ini file should look something like this::
fr: Après édition, votre fichier weather.ini devrait resembler à ceci::

source: For more detail on the configuration file options, see :doc:`../guides/weather_ini`.
fr: Pour plus de détails sur les options du fichier de configuration, voir :doc:`../guides/weather_ini`.

source: Process the raw data.
fr: Traitement des données brutes.

source: :py:mod:`pywws.LogData` just copies the raw data from the weather station. To do something useful with that data you probably need hourly, daily and monthly summaries. These are created by the :py:mod:`pywws.Process` program. For example::
fr: :py:mod:`pywws.LogData` ne fait que copier les données brutes à partir de la station météo. Pour faire quelque chose d'utile avec ces données vous avez probablement besoin des sommaires horaire, quotidien et mensuel. Ces sommaires sont produits à partir du programme :py:mod:`pywws.Process`. Par example::

source: You should now have some processed files to look at::
fr: Vous devriez avoir ainsi quelques fichiers traités à consulter::

source: If you ever change your ``day end hour`` configuration setting, you will need to reprocess all your weather data. You can do this by running the :py:mod:`Reprocess` program::
fr: Si vous changez votre période de fin du jour avec l'option de configuration ``day end hour`` , vous devrez re-traiter toutes vos données météo. Pour ce faire, exécutez le programme :py:mod:`Reprocess`::

source: Set the weather station logging interval.
fr: Fixer l'intervale d'enregistrement de la station météo.

source: Your weather station probably left the factory with a 30 minute logging interval. This enables the station to store about 11 weeks of data. Most pywws users set up their computers to read data from the station every hour, and only need the station to store enough data to cover computer failures. The recommended interval is 5 minutes, which still allows 2 weeks of storage. Use the :py:mod:`SetWeatherStation` program to set the interval::
fr: Votre station météo a probablement quitté l'usine avec un intervale d'enregistrement de 30 minutes. Ceci permet à la station d'enregistrer environ 11 semaines de données. La plupart des utilisateurs de pywws configurent leur ordinateur pour lire les données de la station à chaque heure, et souhaitent que la station contienne assez de données pour couvrir d'éventuelles panne d'ordinateur. l'intervale recommandé est de 5 minutes, ce qui représente 2 semaines de données. Utilisez le programme:py :mod:`SetWeatherStation` pour fixer l'intervale::

source: You are now ready to set up regular or continuous logging, as described in :doc:`hourlylogging` or :doc:`livelogging`.
fr: Vous êtes maintenant prêt pour fixer une journalisation régulière ou continue, telle que décrit dans la section :doc:`hourlylogging` ou :doc:`livelogging`.

source: Read the documentation.
fr: Lire la documentation.

source: The doc directory in your pywws source directory contains HTML and plain text versions of the documentation. The HTML files can be read with any web browser. Start with the index (:doc:`../index`) and follow links from there.
fr: Le dossier doc du répertoire source de pywws contien une version HTML et une version en texte clair de la documentation. Les fichiers HTML peuvent être lus avec tous navigateurs. Débutez avec l'index (:doc:`../index`) et suivez les liens à partir de ce point.

source: Comments or questions? Please subscribe to the pywws mailing list http://groups.google.com/group/pywws and let us know.
fr: Commentaires ou questions? SVP, souscrivez à la liste d'envoi de pywws http://groups.google.com/group/pywws et laissez-le nous savoir.

source: How to set up 'hourly' logging with pywws
fr: Comment configurer la journalisation horaire avec pywws

source: There are two quite different modes of operation with pywws. Traditionally the :doc:`../api/Hourly` program would be run at regular intervals (usually an hour) from cron. This is suitable for fairly static websites, but more frequent updates can be useful for sites such as Weather Underground (http://www.wunderground.com/). The newer :doc:`../api/LiveLog` program runs continuously and can upload data every 48 seconds.
fr: Pywws offre deux modes de fonctionnement très différents. Traditionellement le programme :doc:`../api/Hourly` devrait être exécuté à intervale régulier (habituellement une heure) à partir d'une tâche cron. Ceci convient aux sites Web plutôt statiques, mais des mises à jour plus fréquentes peuvent être utiles pour des sites comme Weather Underground (http://www.wunderground.com/). Le plus récent programme :doc:`../api/LiveLog` s'exécute continuellement et peut envoyer des données à chaque 48 secondes.

source: Note that although this document (and the program name) refers to 'hourly' logging, you can run the Hourly.py program as often or as infrequently as you like, but don't try to run it more often than half your logging frequency. For example, if your logging interval is 10 minutes, don't run Hourly.py more often than every 20 minutes.
fr: Notez que bien que ce document (et le nom du programme) réfère à la journalisation horaire (hourly), vous pouvez exécuter le programme Hourly.py aussi souvent ou peu fréquemment que vous le souhaitez, mais n'essayez pas de l'exécuter plus souvent que le double de la fréquence d'historique. Par exemple, si votre intervale d'historique est de 10 minutes, n'exécutez pas Hourly.py plus fréquemment qu'aux 20 minutes.

source: Getting started
fr: Mise en route

source: First of all, you need to install pywws and make sure it can get data from your weather station. See :doc:`getstarted` for details.
fr: Avant tout, vous devez unstaller pywws et vous assurer qu'il recoit bien les informations de votre station météo. Voir :doc:`getstarted` pour plus de détails.

source: Try running Hourly.py from the command line, with a high level of verbosity so you can see what's happening::
fr: Essayez d'exécuter Hourly.py à partir de la ligne de commande, avec un haut niveau de commentaires pour que vous puissiez voir ce qui se passe::

source: Within five minutes (assuming you have set a 5 minute logging interval) you should see a 'live_data new ptr' message, followed by fetching any new data from the weather station and processing it.
fr: En moins de cinq minutes (assumant que vous avez un interval de relevé de 5 minutes) vous devriez voir le message 'live_data new ptr', suivi par la recherche et le traitement de nouvelles données de la station météorologique.

source: Configuring file locations
fr: Configurer la licalisation des fichiers

source: Open your weather.ini file with a text editor. You should have a ``[paths]`` section similar to the following (where ``xxx`` is your user name)::
fr: Ouvrez votre fichier weather.ini avec un éditeur de texte. Vous devriez avoir une section ``[paths]`` similaire à ce qui suit (où ``xxx`` est votre nom d'usager)::

source: Edit these to suit your installation and preferences. ``work`` is a temporary directory used to store intermediate files, ``templates`` is the directory where you keep your text template files and ``graph_templates`` is the directory where you keep your graph template files. Don't use the pywws example directories for these, as they will get over-written when you upgrade pywws.
fr: Éditez pour correspondre à votre installation et à vos préférences. ``work`` est un dossier temporaire utilisé pour emmagasiner les fichiers intermédiaires, ``templates`` est le dossier où vous gardez vos fichiers de gabarit texte et ``graph_templates`` est le dossier où vous gardez vos fichiers de gabarit graphes. Ne pas utiliser les dossiers exemple de pywws pour celà, puisqu'ils seront écrasés lors de mise à jour de pywws.

source: Copy your text and graph templates to the appropriate directories. You may find some of the examples provided with pywws useful to get started.
fr: Copiez vos fichiers de gabarits texte et graphes dans les dossiers appropriés. Vous pouvez trouver quelques exemples fournis avec pywws fort utiles pour démarrer.

source: Configuring periodic tasks
fr: Configurer les tâches périodiques

source: In weather.ini you should have ``[logged]``, ``[hourly]``, ``[12 hourly]`` and ``[daily]`` sections similar to the following::
fr: Dans weather.ini vous devriez avoir les sections ``[logged]``, ``[hourly]``, ``[12 hourly]`` et ``[daily]`` similaire à celle-ci::

source: These specify what Hourly.py should do when it is run. Tasks in the ``[logged]`` section are done every time there is new logged data, tasks in the ``[hourly]`` section are done every hour, tasks in the ``[12 hourly]`` section are done twice daily and tasks in the ``[daily]`` section are done once per day.
fr: Ces sections spécifient ce que devrait faire Hourly.py à chaque exécution. Les tâches dans la section ``[logged]`` sont réalisées à chaque fois qu'une donnée est enregistrée, les tâches dans la section ``[hourly]`` sont exécutées à chaque heure, les tâches dans la section ``[12 hourly]`` sont lancées deux fois par jour, tandis que les tâches dans la section ``[daily]`` sont réalisées une fois par jour.

source: The ``services`` entry is a list of online weather services to upload data to. The ``plot`` and ``text`` entries are lists of template files for plots and text files to be uploaded to your web site, and the ``twitter`` entry is a list of templates for messages to be posted to Twitter. Add the names of your template files and weather services to the appropriate entries, for example::
fr: Les entrées dans ``services`` sont une liste de services météo en ligne sur lesquels envoyer vos données météo. Les entrées ``plot`` et ``text`` sont des listes de fichiers gabarits graphes et texte à téléverser sur votre site web, et l'entrée ``twitter`` est une liste de gabarits pour les messages à poster sur Twitter. Ajoutez les coms de vos fichiers de gabarit et de services météo à l'entrée correspondante, par exemple::

source: You can test that all these are working by removing all ``last update`` lines from weather.ini then run Hourly.py again::
fr: Vous pouvez réaliser un test de bon fonctionnement en enlevant toute les lignes ``last update`` du fichier weather.ini, puis exécutez Hourly.py de nouveau::

source: Run as a cron job
fr: Exécuter en tant que tâche 'cron'

source: Most UNIX/Linux systems have a 'cron' daemon that can run programs at certain times, even if you are not logged in to the computer. You edit a 'crontab' file to specify what to run and when to run it. For example, to run Hourly.py every hour, at zero minutes past the hour::
fr: La plupart des systèmes UNIX/Linux possèdent un service 'cron' qui à pour tâche d'exécuter un programme spécifié à un intervale défini, même si vous n'êtes pas connecté à votre session. Vous éditez un fichier 'crontab' pour spécifier ce qui doit être exécuté et quand. Par exemple, pour exécuter Hourly.py à chaque heure, à zero minutes de l'heure::

source: This might work, but if it didn't you probably won't get any error messages to tell you what went wrong. It's much better to run a script that runs Hourly.py and then emails you any output it produces. Here's the script I use::
fr: Ceci devrait fonctionner, mais si ce n'Est pas le cas vous n'obtiendrez probablement pas de messages d'erreur vous indiquant ce qui ne va pas. Il est préférable d'exécuter un script qui lance Hourly.py puis vous envoi un courriel avec tout message qui aurait pu être produit. Voici le script que j'utilise::

source: You’ll need to edit this quite a lot to suit your file locations and so on, but it gives some idea of what to do.
fr: Vous devrez éditer beaucoup pour adapter à vos emplacements de dossier et ainsi de suite, mais il donne une certaine idée de ce qui peut être fait.

source: User guides
fr: Guides utilisateur

source: Contents:
fr: Contenu:

source: How to make a language file for pywws
fr: Comment faire un fichier de langage pour pywws
