Repository: jim-easterbrook/pywws
Catalog: translations/*/guides.po
Languages: fr

source: fixed: values copied from the weather station's "fixed block"
fr: fixed: valeurs copiées à partir des "blocs fixes" de la station météo

source: This section is written by pywws and should not be edited.
fr: Cette section est gérée par pywws et ne doit pas être éditée.

source: live: tasks to be done every 48 seconds
fr: live: tâches à accomplir à chaque 48 secondes

source: This section specifies tasks that are to be carried out for every data sample during 'live logging', i.e. every 48 seconds. It is unlikely that you'd want to do anything other than upload to Weather Underground or update your YoWindow file this often.
fr: Cette section spécifie les tâche devant être effectuées pour chaque échantillonage pendant la 'journalisation temps réel', c.à.d. chaque 48 secondes. Il est peu probable que vous vouliez faire autre chose que le téléversement à Weather Underground ou la mise-à-jour du fichier YoWindow aussi souvent.

source: ``services`` is a list of 'services' to upload data to. Each one listed must have a configuration file in ``pywws/services/``. See :doc:`../api/pywws.toservice` for more detail.
fr: ``services`` est une liste de 'services' auxquels envoyer vos données. Chaque service listé doit avoir un fichier de configuration dans le dossier ``pywws/services/``. Voir :doc:`../api/pywws.toservice` pour plus de détails.

source: ``twitter`` is a list of text templates to be processed and posted to Twitter.
fr: ``twitter`` est une liste de gabarit texte à traiter avant de les poster sur Twitter.

source: ``text`` and ``plot`` are lists of text and plot templates to be processed and uploaded to your website.
fr: ``text`` et ``plot`` sont des listes de gabarits texte et graphe à traiter et à téléverser sur votre site web.

source: ``yowindow`` is the full path of an xml file to be generated for a YoWindow weather widget (see http://yowindow.com/). If you don't use YoWindow, leave this entry out.
fr: ``yowindow`` indique le chemin complet du fichier au format xml à générer pour le widget YoWindow weather (voir http://yowindow.com/). Si vous n'employez pas YoWindow, omettez cette entrée.

source: logged: tasks to be done every time the station logs a data record
fr: logged: tâches à accomplir chaque fois que la station enregistre une lecture

source: This section specifies tasks that are to be carried out every time a data record is logged when 'live logging' or every time an hourly cron job is run.
fr: Cette section spécifie les tâche devant être réalisées chaque fois qu'une donnée est lue en mode 'temps réel' ou chaque fois qu'une tâche horaire cron est exécutée.

source: hourly: tasks to be done every hour
fr: hourly: tâches à réaliser à chaque heure

source: This section specifies tasks that are to be carried out every hour when 'live logging' or running an hourly cron job.
fr: Cette section spécifie ;es tâches à réaliser à chaque heure en mode 'temps réel' ou exécutée en tant que tâche horaire cron.

source: 12 hourly: tasks to be done every 12 hours
fr: 12 hourly: tâches à réaliser à chaque 12 heures

source: This section specifies tasks that are to be carried out every 12 hours when 'live logging' or running an hourly cron job. Use it for things that don't change very often, such as monthly graphs.
fr: Cette section spécifie ;es tâches à réaliser à chaque heure en mode 'temps réel' exécutée en tant que tâche horaire cron. Utilisez pour des choses qui ne changent pas vraiment souvent, tel que les graphes mensuels.

source: daily: tasks to be done every 24 hours
fr: daily: tâches à faire à chaque 24 heures

source: This section specifies tasks that are to be carried out every day when 'live logging' or running an hourly cron job. Use it for things that don't change very often, such as monthly or yearly graphs.
fr: Cette section spécifie ;es tâches à réaliser à chaque heure en mode 'temps réel' exécutée en tant que tâche horaire cron. Utilisez pour des choses qui ne changent pas vraiment souvent, tel que les graphes mensuels ou annuels.

source: ftp: configuration of uploading to a website
fr: ftp: configuration pour le téléversement du un site web

source: These entries provide details of your website (or local directory) where processed text files and graph images should be transferred to.
fr: Ces entrées fournissent des détails sur votre site web (ou répertoire local) où doivent être transférés les fichier de texte et de graphe traités.

source: ``local site`` specifies whether the files should be copied to a local directory or sent to a remote site. You may want to set this if you run your web server on the same machine as you are running pywws on.
fr: ``local site`` spécifie si les fichiers doivent être copiés dans un dossier local ou envoyé sur un site distant. Vou pouvez vouloir fixer ce paramètre si vous exécutez votre serveur web sur le même ordinateur qui exécute pywws.

source: ``secure`` specifies whether to transfer files using SFTP (secure FTP) instead of the more common FTP. Your web site provider should be able to tell you if you can use SFTP.
fr: ``secure`` spécifie si le transfert des fichiers utilise SFTP (FTP securisé) au lieu de l'habituel FTP. Votre hébergeur doit être en mesure de vous dire si vous pouvez utiliser SFTP.

source: ``site`` is the web address of the FTP site to transfer files to.
fr: ``site`` est l'adresse web de votre site FTP à laquelle transférer vos fichiers.

source: ``user`` and ``password`` are the FTP site login details. Your web site provider should have provided them to you.
fr: ``user`` et ``password`` sont les informations de branchement pour votre site FTP. Votre hébergeur doit vous avoir fourni ces informations.

source: ``directory`` specifies where on the FTP site (or local file system) the files should be stored. Note that you may have to experiment with this a bit - you might need a '/' character at the start of the address.
fr: ``directory`` spécifie où sur le site FTP (ou le disque local) les fichiers doivent être envoyés. Notez que vous pourriez devoir expérimenter quelque peu - vous pourriez devoir utiliser un caractère '/' au début de votre adresse.

source: twitter: configuration of posting to Twitter
fr: twitter: configuration pour poster sur Twitter

source: ``secret`` and ``key`` are authentication data provided by Twitter. To set them, run the ``TwitterAuth.py`` program.
fr: ``secret`` et ``key`` sont les données d'authentication fournies par Twitter. Por les configurer, exécutez le programme ``TwitterAuth.py``.

source: ``latitude`` and ``longitude`` are optional location data. If you include them then your weather station tweets will have location information so users can see where your weather station is. It might also enable people to find your weather station tweets if they search by location.
fr: ``latitude`` et ``longitude`` sont vos données de localisation et sont are optionelles. Si vous les incluez dans vos 'tweets météo' vos utilisateurs pourront voir oz est située votre station. Ce qui pourrait aider les utilisateurs à trouver votre station s'ils cherchent par localisation.

source: underground, metoffice, temperaturnu etc: configuration of posting to 'services'
fr: underground, metoffice, temperaturnu etc: configuration pour poster sur ces 'services'

source: These sections contain information such as passwords and station IDs needed to upload data to weather services. The names of the data entries depend on the service. The example shown is for Weather Underground.
fr: Ces sections contiennent l'information nécessaire pour envoyer vos données sur ces services météo, tel que mot de passe et ID de votre station. Les noms de ces entrées de données dépend du service. L'exemple montré affiche les informations pour Weather Underground.

source: ``station`` is the PWS ID allocated to your weather station by Weather Underground.
fr: ``station`` est le PWS ID (Identificateur de station) alloué à la station météo par Weather Underground.

source: ``password`` is your Weather Underground password.
fr: ``password`` est votre mot de passe pour Weather Underground.

source: ``last update`` is set by pywws when you upload to a weather service.
fr: ``last update`` est ficé par pywws lorsque vous téléversez à un service météo.
