Repository: jim-easterbrook/pywws
Catalog: translations/*/guides.po
Languages: fr

source: Some parts of pywws can be configured to use your local language instead of British English. This requires an appropriate language file which contains translations of the various strings used in pywws. The pywws project relies on users to provide these translations. This document describes how to create a language file.
fr: Certaines parties de pywws peut être configurées pour utiliser votre langue locale en lieu de l'Anglais Britanique. Ceci requière un fichier de langage contenant la traduction des différentes phrases utilisées par pywws. Le projet repose sur les utilisateur qui fournissent ces traductions. Ce document décrit comment créer un fichier de langage.

source: Dependencies.
fr: Prérequis.

source: As well as the pywws software you need to install the 'gettext' GNU internationalisation utilities package. This is available from the standard repositories for most Linux distributions, or you can download it from http://www.gnu.org/software/gettext/ if you need to compile it yourself.
fr: En plus du logiciel pywws vous devez installer le paquet utilitaire GNU d'internationalisation 'gettext'. Celui-ci est disponible dans la plupart des dépôts standard des distributions Linux, ou vous pouvez le télécharger à partir de http://www.gnu.org/software/gettext/ si vous devez le compiler vous même.

source: Getting started.
fr: Démarrage.

source: Your pywws directory should already have a subdirectory called languages. This contains the existing set of language files, for example 'sv.po' contains the Swedish translations. If one of these languages is what you need, then edit your weather.ini file and add a 'language' entry to the '[config]' section, for example::
fr: Votre dossier pywws doit déjà contenir un sous-dossier nommé 'languages'. Celui-ci contien l'ensemble de fichiers de langue actuel, par exemple 'fr.po' contien la traduction française. Si une de ces langues est ce que vous désirez, alors editez votre fichier weather.ini et ajoutez une entrée 'language' à la section '[config]', par exemple::

source: If there isn't already a file for your language, the rest of this document tells you how to create one.
fr: S'il n'y a pas déjà de fichier pour votre langage, le reste de ce document vous indique comment en créer un.

source: Choose your language code.
fr: Choisir votre code de langage.

source: Computers use IETF language tags (see http://en.wikipedia.org/wiki/IETF_language_tag). For example, in the UK we use 'en_GB'. This has two parts: 'en' for English, and 'GB' for the British version of it. To find the correct code for your language, consult the list at http://www.gnu.org/software/gettext/manual/gettext.html#Language-Codes.
fr: Les ordinateur utilisent les étiquettes d'identification de langues IETF (voir http://fr.wikipedia.org/wiki/%C3%89tiquette_d%27identification_de_langues_IETF). Par exemple, la Grande-Bretagne utilise 'en_GB' qui est composé de 2 parties: 'en' pour Anglais, et 'GB' la version Britanique. Pour trouver le code correspondant à votre langue, consultez la liste sur http://www.gnu.org/software/gettext/manual/gettext.html#Language-Codes.

source: Create a language file.
fr: Créer un fichier de langage.

source: The 'makefile' included with pywws can create a template file for you to fill in. For example, to create a file for the French language (code 'fr')::
fr: Le 'makefile' inclu avec pywws peut créer un fichier gabarit à remplir pour vous. Par exemple, pour créer un fichier pour la langue françaisee (code 'fr')::

source: This will ask you to confirm your email address, then create a file 'code/languages/fr.po'. You should now edit this file, filling in every 'msgstr' line with a translation of the 'msgid' line immediately above it. The reason for including your email address is to allow anyone who has questions about your translation to get in touch with you. Feel free to put in an invalid address if you are concerned about privacy.
fr: Ce qui vous demandera de confirmer votre adresse courriel, puis créera un fichier 'code/languages/fr.po'. Vous devez maintenant éditer ce fichier et remplir chaque ligne 'msgstr' avec une traduction de la ligne 'msgid' immédiatement au-dessus. La raison d'inclure votre adresse courriel est de permettre à chacun ayant une question à propos de la traduction de vous rejoindre. Sentez vous libre de mettre une adresse invalide si vous êtes préoccupé du maintien de votre vie privée.

source: After you've edited your new language file it needs to be compiled so that pywws can use it. This is also done by the makefile::
fr: Après avoir édité le nouveau fichier de langage, il doit être compilé pour que pywws puisse l'utiliser. Ce qui est fait aussi par le fichier makefile::

source: Don't forget to do this every time you edit a language file.
fr: N'oubliez pas de faire celà à chaque fois que vous éditez un fichier de langue.

source: Test the pywws translation.
fr: Tester la traduction pywws.

source: Edit the language entry in your weather.ini file to use your language code (e.g. 'fr'), then try using Plot.py to plot a graph. The X-axis of the graph should now be labeled in your language, using the translation you provided for 'Time', 'Day' or 'Date'.
fr: Éditez l'entrée de langue dans votre fichier weather.ini pour utiliser le code de langue (ex. 'fr'), puis essayer d'utiliser Plot.py pour dessiner un graphe. L'axe des X du graphe devrait maintenant être étiquetté dans votre langue, utilisant la traduction que vous avez fournis pour 'Time', 'Day' ou 'Date'.

source: Send Jim the language file.
fr: Envoyez le fichier de langue à Jim.

source: I'm sure you would like others to benefit from the work you've done in making a new language file for pywws. Please, please, please send a copy of your language file (for example fr.po) to jim@jim-easterbrook.me.uk.
fr: Je suis sur que vous souhaitez que les autres bénificie du travail que vous avez fait en faisant ce nouveau fichier de langue pour pywws. SVP, Svp, svp envoyez une copie de votre fichier de langue (par exemple fr.po) à jim@jim-easterbrook.me.uk.

source: Update the language file.
fr: Mettre à jour le fichier de langue.

source: As pywws is extended, new strings may be added which will require your translation file to be extended as well. This is fairly easy to do. First you need to remove the language master template file::
fr: Comme pywws évolue, de nouvelles phrases peuvent avoir été ajoutées et nécessiteront que votre fichier de traduction évolue lui aussi. Celà est très facile à faire. Premièrement, Vous devez enlever le fichier de gabarit de langue maître::

source: Now run the make command again as in section 5 above. This should add the new strings to your language file, without changing the strings you've already translated.
fr: Maintenant, exécutez la commande 'make' de nouveau tel qu'indiqué dans la section 5 ci-dessus. Ceci devrait ajouter de nouvelles phrases à votre fichier de langage, sans changer les phrases que vous avez déjà traduites.

source: How to set up 'live' logging with pywws
fr: Comment configurer le mode 'live' avec pywws

source: Try running LiveLog.py from the command line, with a high level of verbosity so you can see what's happening::
fr: Essayez d'exécuter LiveLog.py à partir de la ligne de commande, avec un haut niveau de commentaires pour que vous puissiez voir ce qui se passe::

source: Within five minutes (assuming you have set a 5 minute logging interval) you should see a 'live_data new ptr' message, followed by fetching any new data from the weather station and processing it. Let LiveLog.py run for a minute or two longer, then kill the process by typing '<Ctrl>C'.
fr: En moins de cinq minutes (assumant que vous avez un interval de relevé de 5 minutes) vous devriez voir le message 'live_data new ptr', suivi par la recherche et le traitement de nouvelles données de la station météorologique. Laissez LiveLog.py fonctionner une ou deux minutes de plus, puis arrêtez le processus en tapant '<Ctrl>C'.

source: In weather.ini you should have a ``[live]`` section similar to the following::
fr: Dans weather.ini vous devriez avoir une section ``[live]`` similaire à celle-ci::

source: This section specifies what pywws should do every time it gets a new reading from the weather station, i.e. every 48 seconds. The ``services`` entry is a list of online weather services to upload data to, e.g. ``['underground']``. The ``plot`` and ``text`` entries are lists of template files for plots and text files to be uploaded to your web site, and the ``twitter`` entry is a list of templates for messages to be posted to Twitter. You should probably leave all of these blank except for ``services``.
fr: Cette section spécifie ce que devrait faire pywws à chaque fois qu'il recoit une lecture de la station météo, ex. toutes les 48 secondes. Les entrées ``services`` est une liste de services météo en ligne sur lesquels envoyer vos données météo, ex. ``['underground']``. LEs entrées ``plot`` et ``text`` sont des listes de fichiers gabarits graphes et texte à téléverser sur votre site web, et l'entrée ``twitter`` est une liste de gabarits pour les messages à poster sur Twitter. Vous devriez probablement laisser toutes ces entrées vides, sauf pour ``services``.

source: If you use YoWindow (http://yowindow.com/) you can add an entry to the ``[live]`` section to specify your YoWindow file, e.g.::
fr: Si vous utilisez YoWindow (http://yowindow.com/) vous pouvez ajouter l'entrée à la section ``[live]`` pour spécifier votre fichier YoWindow, ex.::

source: If you don't already have them, create four more sections in your weather.ini file: ``[logged]``, ``[hourly]``, ``[12 hourly]`` and ``[daily]``. These sections should have similar entries to the ``[live]`` section, and specify what to do every time data is logged (5 to 30 minutes, depending on your logging interval), every hour, twice daily and once per day. Add the names of your template files to the appropriate entries, for example::
fr: Si vous ne les avez pas déjà, créeez quatre sections supplémentaires dans votre fichier weather.ini : ``[logged]``, ``[hourly]``, ``[12 hourly]`` et ``[daily]``. Ces sections doivent avoir des entrées similaires à la section ``[live]``, et spécifiez ce qui doit être fait chaque fois qu'une donnée est enregistrée (5 à 30 minutes, dépendant de votre intervale), chaque heure, deux fois par jour et chaque jour. Ajoutez les noms de vos fichiers de gabarit à l'entrée appropriée, par exemple::

source: Run in the background
fr: Exécuter en arrière-plan

source: In order to have LiveLog.py carry on running after you finish using your computer it needs to be run as a 'background job'. On most Linux / UNIX systems you can do this by putting an ampersand ('&') at the end of the command line. For example::
fr: Afin que LiveLog.py continue de fonctionner après avoir fini d'utiliser votre ordinateur, vous devez exécuter ce programme en tant que 'tâche en arrière^plan'. Sur la plupart des systèmes Linux / UNIX vous pouvez faire celà en ajoutant simplement le symbole ('&') à la fin de la ligne de commande. Par exemple::

source: However, it would be useful to know what went wrong if the program crashes for any reason. LiveLog.py can store its messages in a log file, specified with the -l option::
fr: Cependant, il peut être utile de savoir ce qui ne va pas si le programme se bloque pour une raison quelconque. LiveLog.py peut enregistrer ces messages dans un fichier d'historique, pour ce faire spécifiez l'option -l::

source: Automatic restarting
fr: Redémarrage automatique

source: There are various ways of configuring a Linux system to start a program when the machine boots up. Typically these involve putting a file in /etc/init.d/, which requires root privileges. A slightly harder problem is ensuring a program restarts if it crashes. My solution to both problems is to run the following script from cron, every hour. ::
fr: Il y a une variété de manière de configurer un système Linux pour lancer un programme au démarrage de l'ordinateur. Typiquement ceci vous devez mettre un fichier dans /etc/init.d/, ce qui requière les privilèges 'root'. S'arrurer du redémarrage d'un programme après 'plamtage' est un problème légèrement plus difficile. Ma solution à ces problèmes est d'exécuter le script suivant à partir d'une tâche cron, à chaque heure. ::

source: This stores the process id of the running LiveLog.py in pidfile. If the process is running, the script does nothing. If the process has crashed, it emails the last 40 lines of the log file to me (using a script that creates a message and passes it to sendmail) and then restarts LiveLog.py. You'll need to edit this quite a lot to suit your file locations and so on, but it gives some idea of what to do.
fr: Ce script enregistre l'identificateur de processus exécutant LiveLog.py dans le pidfile. Si le processus fonctionne, le script ne fait rien. Si le processus a bloqué, il m'envoi un courriel contenant les 40 dernières lignes du fichier d'historique (en utilisant un script qui crée un message et l'envoi par sendmail) puis redémarre LiveLog.py. Vous devrez éditer beaucoup pour adapter à vos emplacements de dossier et ainsi de suite, mais il donne une certaine idée de ce qui doit être fait.

source: How to configure pywws to post messages to Twitter
fr: Comment configurer pywws pour poster des messages sur Twitter

source: Python 2.5+ - http://python.org/ (Note: Python 3 is not supported.)
fr: Python 2.5+ - http://python.org/ (Note: Python 3 n'est pas supporté.)

source: Note that simplejson is included in Python 2.6+
fr: Note: simplejson est inclu dans Python 2.6+

source: Create a Twitter account.
fr: Créer un compte Twitter.

source: You could post weather updates to your 'normal' Twitter account, but I think it's better to have a separate account just for weather reports. This could be useful to someone who lives in your area, but doesn't want to know what you had for breakfast.
fr: Vous pouvez poster des mise-à-jour météo sur votre compte Twitter 'normal', mais je crois qu'il est préférable d'avoir un compte distinct réservé à vos relevés météo. Ce qui pourrait être fort utile à une perspmme vivant dans votre voisinage, mais ne souhaitant pas savoir ce que vous avez pris au petit déjeuner.

source: Authorise pywws to post to your Twitter account.
fr: Autoriser pywws à poster sur votre compte Twitter.

source: Make sure no other pywws software is running, then run the :py:mod:`TwitterAuth` program::
fr: Assurez vous qu'aucune autre instance de pywws ne fonctionne, puis exécutez le programme :py:mod:`TwitterAuth`::

source: (Replace ``/data/weather`` with your data directory.)
fr: (Remplacez ``/data/weather`` par votre répertoire de données.)

source: This will open a web browser window (or give you a URL to copy to your web browser) where you can log in to your Twitter account and authorise pywws to post. Your web browser will then show a 7 digit number which you need to copy to the :py:mod:`TwitterAuth` program. If successful, your weather.ini file will now have a ``[twitter]`` section with ``secret`` and ``key`` entries. (Don't disclose these to anyone else.)
fr: Ceci ouvrira une fenêtre de navigation (ou vous donnera une URL à copier dans votre navigateur) où vous pourrez vous connecter à votre compte Twitter et autoriser pywws à poster. Votre navigateur vous affichera alors un nombre à 7 chiffre que vous aurez besoin de copier dans le programme :py:mod:`TwitterAuth`. Si tout s'est bien déroulé, votre fichier weather.ini devrait comporter une nouvelle section ``[twitter]`` avec les entrées ``secret`` et ``key``. (Ne révéler à quiconque.)

source: Add location data (optional).
fr: Ajouter vos données de localisation (optionel).

source: Edit your weather.ini file and add ``latitude`` and ``longitude`` entries to the ``[twitter]`` section. For example::
fr: Éditez cotre fichier weather.ini et ajoutez les entrées ``latitude`` et ``longitude`` à votre section ``[twitter]``. Par exemple::

source: Create a template.
fr: Créer un gabarit.

source: Twitter messages are generated using a template, just like creating files to upload to a website. Copy the example template 'tweet.txt' to your template directory, then test it::
fr: Les message pour Twitter sont générés en utilisant un gabarit, tout comme sont créés les fichiers à téléverser sur votre site web. Copiez le gabarit exemple 'tweet.txt' dans votre dossier de gabarit, puis testez-le::

source: (Replace ``/data/weather`` and ``~/weather/templates`` with your data and template directories.) If you need to change the template (e.g. to change the units or language used) you can edit it now or later.
fr: (Remplacez ``/data/weather`` et ``~/weather/templates`` par vos répertoires de données et de gabarits.) Si vous avez besoin de modifier le gabarit (ex. pour changer les unités de mesure ou la langue utilisée) vous pouvez l'éditer maintenant ou ultérieurement.

source: Post your first weather Tweet.
fr: Poster votre premier Tweet météo.

source: Now everything is prepared for :py:mod:`pywws.ToTwitter` to be run::
fr: Maintenant que tout est pret pour :py:mod:`pywws.ToTwitter` vous pouvez exécuter::

source: If this works, your new Twitter account will have posted its first weather report. (You should delete the tweet.txt file now.)
fr: Si celà fonctionne, Votre nouveau compte Twitter aura posté son premier relevé météo. (Vous devriez supprimer le fichier tweet.txt maintenant.)

source: Add Twitter updates to your hourly tasks.
fr: Ajouter les envois sur Twitter à vos tâche horaire.

source: Edit your weather.ini file and edit the ``[hourly]`` section. For example::
fr: Éditez votre fichier weather.ini et modifiez la section ``[hourly]``. Par exemple::

source: You could change the ``[logged]``, ``[12 hourly]`` or ``[daily]`` sections instead, but I think ``[hourly]`` is most appropriate for Twitter updates.
fr: Vous pourriez tout aussi bien choisir de plutôt modifier les sections ``[logged]``, ``[12 hourly]`` ou ``[daily]``, mais je crois que ``[hourly]`` est le plus approprié pour les envois sur Twitter.

source: weather.ini - configuration file format
fr: weather.ini - format du fichier de configuration

source: Nearly all configuration of pywws is via a single file in the data directory: weather.ini. This file has a structure similar to that of Microsoft Windows INI files. It is divided into "sections", each of which has a number of "name = value" entries. The order in which sections appear is not important.
fr: Presque toute la configuration de pywws est fait via un seul fichier dans le répertoire de donnée: weather.ini. Ce fichier a été structuré de manière similaire aux fichiers INI de Microsoft Windows. Il est divisé en "sections", qui contiennent un nom d'entrée "nom = valeur". L'ordre d'apparition des sections n'a pas d'importance.

source: Some entries in the file are set by pywws, while others need to be edited by the user. Any plain text editor can be used to do this. (Don't try to edit the file while any other pywws software is running.) In many cases pywws will initialise the entries to sensible values.
fr: Certaines entrées dans le fichier sont configurées par pywws, tandis que d'autres doivent être éditées par l'utilisateur. Tout éditeur de texte brut peut être utilisé pour ce faire. (Ne pas essayer d'éditer le fichier pendant le fonctionnement de pywws.) Dans plusieurs cas, pywws initialisera les entrées avec des valeurs importantes.

source: The following sections are currently in use:
fr: Les sections suivantes sont présentement utilisées:

source: config: miscellaneous system configuration.
fr: config: diverses configuration système.

source: paths: directories in which templates etc. are stored.
fr: paths: dossiers dans lesquels sont emmagasinés les gabarits, etc.

source: fixed: values copied from the weather station's "fixed block".
fr: fixed: valeurs copiées à partir des "blocs fixes" de la station météo.

source: live: tasks to be done every 48 seconds.
fr: live: tâches à accomplir à chaque 48 secondes.

source: logged: tasks to be done every time the station logs a data record.
fr: logged: tâches à accomplir chaque fois que la station enregistre une lecture.

source: hourly: tasks to be done every hour.
fr: hourly: tâches à réaliser à chaque heure.

source: 12 hourly: tasks to be done every 12 hours.
fr: 12 hourly: tâches à réaliser à chaque 12 heures.

source: daily: tasks to be done every day.
fr: daily: tâches à faire chaque jour.

source: ftp: configuration of uploading to a website.
fr: ftp: configuration pour le téléversement du un site web.

source: twitter: configuration of posting to Twitter.
fr: twitter: configuration pour poster sur Twitter.

source: underground, metoffice, temperaturnu etc: configuration of posting to 'services'.
fr: underground, metoffice, temperaturnu etc: configuration pour poster sur ces 'services'.

source: config: miscellaneous system configuration
fr: config: diverses configuration système

source: ``day end hour`` is the end of the "`meteorological day <http://en.wikipedia.org/wiki/Meteorological_day>`_", in local time without daylight savings time. Typical values are 21, 9, or 24.
fr: ``day end hour`` est la fin du "`jour météorologique <http://en.wikipedia.org/wiki/Meteorological_day>`_", selon l'heure locale sans tenir compte de l'heure d'été. Généralement, les valeurs sont 21, 9, ou 24.

source: ``gnuplot encoding`` is the text encoding used when plotting graphs. The default value of ``iso_8859_1`` allows the degree symbol, which is useful in a weather application! Other values might be needed if your language includes accented characters. The possible values depend on your gnuplot installation so some experimentation may be needed.
fr: ``gnuplot encoding`` est l'encodage de texte utilisé lors du tracé de graphes. La valeur par défaut est ``iso_8859_1`` permettant le symbole des degrés, fort utile dans une application météorologique! D'autres valeurs peuvent être nécessaire si votre langue comporte des caractères accentués. Les valeurs possible dépendent de votre installation gnuplot, quelques expérimentations peuvent donc être nécessaire.

source: ``language`` is used to localise pywws. It's optional, as pywws usually uses the computer's default language as set by the LANG environment variable. The available languages are those in the ``locale`` subdirectory of your pywws installation. If you set any other language, pywws will fall back to using English.
fr: ``language`` est utilisé pour traduire pywws. Il est optionnel, puisque pywws utilise habituellement la langue par défaut de l'ordinateur tel que configuré par la variable d'environnement LANG. Vous trouverez les langages disponibles dans le sous-dossier ``locale`` de votre installation pywws. Si vous configurez une langue qui n'est pas inclus, pywws affichera en anglais.

source: ``logdata sync`` sets the quality of synchronisation used by :doc:`../api/pywws.LogData`. Set it to 0 for fast & inaccurate or 1 for slower but precise.
fr: ``logdata sync`` configure la qualité de la synchronisation utilisé par :doc:`../api/pywws.LogData`. Fixer à 0 pour rapide & imprécis ou 1 pour plus lent, mais précis.

source: paths: directories in which templates etc. are stored
fr: paths: dossiers dans lesquels sont emmagasinés les gabarits, etc.

source: These three entries specify where your text templates and graph templates are stored, where temporary files should be created, and (if you have one) the location of your calibration module.
fr: Ces trois entrées spécifient où sont emmagasiné vos gabarits de texte et de graphes, où doivent être créé les fichiers temporaires, et la localisation de votre module de calibration (si utilisé).
